$('.user').slider({
    // controls: false, // возможность ручного управления слайдером
    // color: "purple", // цвет управляющих элементов слайдера
    // size: 'contain', // типы размещения фотографий:
                        // если stretching (растягивание), то картинка растягивается по размеру слайдера
                        // если cover(покрытие), то картинка покрывает весь слайдер и обрезаются вылезающие части
                        // если contain(вмещать) или неизвестное значение, то картинка полностью вмещается в слайдер
    autoSwap: true, // автоматическое переключение слайдов
    autoSwapTime: 2000, // время переключения слайдов
    autoSwapOnMouserover: false // переключение слайдов при наведении
});